FireVirtuozz/ESP32/server/components/ledLib/ledLib.c
#include "ledLib.h"
#include "driver/gpio.h"
#include <inttypes.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "nvsLib.h"
#include "logLib.h"
#include <stdarg.h>
#include <esp_err.h>
#include "driver/ledc.h"
#include "screenLib.h"

#if USE_LVGL_SCREEN
#include "lcdLib.h"
#endif

#if DEBUG_GPIO || DEBUG_LEDC
#include "soc/soc_caps.h"
#endif

#if DEBUG_LEDC
#include "hal/ledc_types.h"
#include "soc/ledc_struct.h"
#include "soc/clk_tree_defs.h"
#include "esp_clk_tree.h"
#endif

#if DEBUG_GPIO
#include "hal/gpio_types.h"
#include "esp_private/esp_gpio_reserve.h"
#endif

//timer configs

//for h-bridge bts7960
#define BTS_TIMER           LEDC_TIMER_0
#define BTS_SPEED_MODE      LEDC_HIGH_SPEED_MODE
#define BTS_GPIO_FWD        32
#define BTS_CHANNEL_FWD     LEDC_CHANNEL_0
#define BTS_GPIO_BWD        33
#define BTS_CHANNEL_BWD     LEDC_CHANNEL_1
#define BTS_FREQ            20000 //max frequency BTS : 25kHz
#define BTS_RESOLUTION      LEDC_TIMER_11_BIT

//for servo mg996r
#define MG_TIMER            LEDC_TIMER_1
#define MG_SPEED_MODE       LEDC_HIGH_SPEED_MODE
#define MG_GPIO             (4) //parentheses reliable to avoid bugs in calculus
#define MG_CHANNEL          LEDC_CHANNEL_2
#define MG_FREQ             50 //50 Hz for mg996r
#define MG_RESOLUTION       LEDC_TIMER_15_BIT

#define LEDC_TEST_FADE_TIME    (3000)

#define LEDC_NUM_TEST 3

//duty properties

//bts7960
#define DEADZONE_MOTOR 5
#define MIN_MOTOR_DUTY_FWD 0
#define MAX_MOTOR_DUTY_FWD 2047 //max duty : 2^resolution - 1
#define MIN_MOTOR_DUTY_BWD 0
#define MAX_MOTOR_DUTY_BWD 2047

//mg996r
#define MIN_SERVO_DUTY 1638
#define MAX_SERVO_DUTY 3277

//LED pin gpio connected on breadboard
#define LED_PIN 2

//global variables
static uint8_t current_angle = 0;
static int8_t current_motor = 0;
static int led_state = 0; //TODO : convert to uint8

//mutex for changes to global variables
static SemaphoreHandle_t xMutex = NULL;

static const char *TAG = "led_library";

/*
* Prepare and set configuration of timers
* that will be used by LED Controller
*/
static ledc_timer_config_t ledc_timer_bts = {
    .duty_resolution = BTS_RESOLUTION, // resolution of PWM duty : 0..8191
    .freq_hz = BTS_FREQ,                      // frequency of PWM signal : 20ms
    .speed_mode = BTS_SPEED_MODE,           // timer mode
    .timer_num = BTS_TIMER,            // timer index
    .clk_cfg = LEDC_AUTO_CLK,              // Auto select the source clock
};

static ledc_timer_config_t ledc_timer_mg = {
    .duty_resolution = MG_RESOLUTION, // resolution of PWM duty : 0..8191
    .freq_hz = MG_FREQ,                      // frequency of PWM signal : 20ms
    .speed_mode = MG_SPEED_MODE,           // timer mode
    .timer_num = MG_TIMER,            // timer index
    .clk_cfg = LEDC_AUTO_CLK,              // Auto select the source clock
};

/*
* Prepare individual configuration
* for each channel of LED Controller
* by selecting:
* - controller's channel number
* - output duty cycle, set initially to 0
* - GPIO number where LED is connected to
* - speed mode, either high or low
* - timer servicing selected channel
*   Note: if different channels use one timer,
*         then frequency and bit_num of these channels
*         will be the same
*/
static ledc_channel_config_t ledc_channel[LEDC_NUM_TEST] = {

    {
        .channel    = BTS_CHANNEL_FWD,
        .duty       = 0,
        .gpio_num   = BTS_GPIO_FWD,
        .speed_mode = BTS_SPEED_MODE,
        .hpoint     = 0,
        .timer_sel  = BTS_TIMER,
        .flags.output_invert = 0
    },
    {
        .channel    = BTS_CHANNEL_BWD,
        .duty       = 0,
        .gpio_num   = BTS_GPIO_BWD,
        .speed_mode = BTS_SPEED_MODE,
        .hpoint     = 0,
        .timer_sel  = BTS_TIMER,
        .flags.output_invert = 0
    },
    {
        .channel    = MG_CHANNEL,
        .duty       = 0,
        .gpio_num   = MG_GPIO,
        .speed_mode = MG_SPEED_MODE,
        .hpoint     = 0,
        .timer_sel  = MG_TIMER,
        .flags.output_invert = 0
    },
};

//semaphore for fade events
static SemaphoreHandle_t counting_sem = NULL;

#if DEBUG_LEDC
static char * mode_str(const ledc_mode_t mode) {
    switch (mode)
    {
    case LEDC_HIGH_SPEED_MODE:
        return "High speed";
    case LEDC_LOW_SPEED_MODE:
        return "Low speed";
    case LEDC_SPEED_MODE_MAX:
        return "Max speed";
    default:
        return "Unknown";
    }
}

static char * itr_str(const ledc_intr_type_t type) {
    switch (type)
    {
    case LEDC_INTR_DISABLE:
        return "Disabled";
    case LEDC_INTR_FADE_END:
        return "Enabled";
    case LEDC_INTR_MAX:
        return "Max";
    default:
        return "Unknown";
    }
}

static char * sleep_str(const ledc_sleep_mode_t sleep) {
    switch (sleep)
    {
    case LEDC_SLEEP_MODE_NO_ALIVE_NO_PD:
        return "No alive, no PD";
    case LEDC_SLEEP_MODE_NO_ALIVE_ALLOW_PD:
        return "No alive, allow PD";
    case LEDC_SLEEP_MODE_KEEP_ALIVE:
        return "Keep alive";
    case LEDC_SLEEP_MODE_INVALID:
        return "Invalid";
    default:
        return "Unknown";
    }
}

static char * clock_str(const ledc_clk_cfg_t clock) {
    switch (clock)
    {
    case LEDC_AUTO_CLK: 
        return "AUTO";
    case LEDC_USE_APB_CLK: //80MHz
        return "APB";
    case LEDC_USE_RC_FAST_CLK: //~8MHz (Low speed only)
        return "RC_FAST";
    case LEDC_USE_REF_TICK: //1MHz
        return "REF_TICK";
    default:
        return "Unknown";
    }
}

static char * event_str(const ledc_cb_event_t event) {
    switch (event)
    {
    case LEDC_FADE_END_EVT:
        return "Fade end";
    default:
        return "Unknown";
    }
}

static soc_module_clk_t get_clock_source_by_register(const ledc_timer_config_t timer) {
    uint32_t tick_sel = LEDC.timer_group[timer.speed_mode].timer[timer.timer_num].conf.tick_sel;
    uint32_t slow_clk_sel = LEDC.conf.slow_clk_sel;

    log_msg(TAG, "High speed clock raw : %d", tick_sel);
    log_msg(TAG, "Low speed clock raw : %d", slow_clk_sel);
    
