FireVirtuozz/ESP32/server/components/ledLib/ledLib.c
    // 0 est la valeur par défaut sécurisée (souvent REF_TICK ou INVALID selon le contexte)
    soc_module_clk_t clk = (soc_module_clk_t)0;

    if (timer.speed_mode == LEDC_HIGH_SPEED_MODE) {
        // High Speed : 1 = APB, 0 = REF_TICK, for ESPs
        clk = (tick_sel == 1) ? SOC_MOD_CLK_APB : SOC_MOD_CLK_REF_TICK;
    } else {
        // Low Speed : global clock
        if (slow_clk_sel == 0) {
            clk = SOC_MOD_CLK_APB;
        } else if (slow_clk_sel == 1) {
            clk = SOC_MOD_CLK_RC_FAST;
        } else if (slow_clk_sel == 2) {
            clk = SOC_MOD_CLK_REF_TICK;
        } else {
            clk = SOC_MOD_CLK_APB; // Default fallback.. TODO: other clocks
        }
    }
    return clk;
}

static void print_timer_config(const ledc_timer_config_t config) {
    log_msg(TAG, "Timer index : %d", config.timer_num); //max?
    log_msg(TAG, "Duty resolution : %d", config.duty_resolution); //max?
    log_msg(TAG, "Frequency : %d", config.freq_hz);
    log_msg(TAG, "Speed mode : %s", mode_str(config.speed_mode));
    log_msg(TAG, "Clock : %s", clock_str(config.clk_cfg));
    log_msg(TAG, "Deconfigure : %s", config.deconfigure ? "Yes" : "No");
}

static void print_channel_config(const ledc_channel_config_t config) {
    log_msg(TAG, "Channel : %d", config.channel); //max?
    log_msg(TAG, "GPIO num : %d", config.gpio_num);
    log_msg(TAG, "Speed mode : %s", mode_str(config.speed_mode));
    log_msg(TAG, "Interrupt type (deprecated) : %s", itr_str(config.intr_type));
    log_msg(TAG, "Timer index : %d", config.timer_sel); //max?
    log_msg(TAG, "Duty : %d", config.duty);
    log_msg(TAG, "Hpoint : %d", config.hpoint);
    log_msg(TAG, "Sleep mode : %s", sleep_str(config.sleep_mode));
    log_msg(TAG, "Deconfigure : %s", config.deconfigure ? "Yes" : "No");
    log_msg(TAG, "Output invert : %s", config.flags.output_invert ? "Yes" : "No");
}

static void print_callback_param(const ledc_cb_param_t cb) {
    log_msg(TAG, "Channel : %d", cb.channel);
    log_msg(TAG, "Event : %s", event_str(cb.event));
    log_msg(TAG, "Speed mode : %s", mode_str(cb.speed_mode));
    log_msg(TAG, "Duty : %s", cb.duty);
}
#endif

#if DEBUG_GPIO
static char * drive_cap_str(const gpio_drive_cap_t drive) {
    switch (drive)
    {
    case GPIO_DRIVE_CAP_0:
        return "Weak";
    case GPIO_DRIVE_CAP_1:
        return "Stronger"; 
    case GPIO_DRIVE_CAP_2:
        return "Medium";
    case GPIO_DRIVE_CAP_3:
        return "Strongest";
    case GPIO_DRIVE_CAP_MAX:
        return "MAX";
    default:
        return "Unknown";
    }
}

static void print_gpio_config(const gpio_io_config_t config) {
    //current (mA) to change pin level
    log_msg(TAG, "Drive strength : %s", drive_cap_str(config.drv));

    //multiplexer, owner of pin (uart, spi..)
    log_msg(TAG, "IOMUX function : %u", config.fun_sel);
    //GPIO Matrix : component using pin
    log_msg(TAG, "Outputting index : %u", config.sig_out);

    //Pull signal up to 3.3v when nothing is connected (internal resistances)
    log_msg(TAG, "Pull-up enabled : %s", config.pu ? "Yes" : "No");
    //Pull signal down to 0v when nothing is connected (internal resistances)
    log_msg(TAG, "Pull-down enabled : %s", config.pd ? "Yes" : "No");

    //input mode : reading signal
    log_msg(TAG, "Input enabled : %s", config.ie ? "Yes" : "No");
    //output mode : generating signal
    log_msg(TAG, "Output enabled : %s", config.oe ? "Yes" : "No");

    //Software, or Peripheral (Hardware) for complex protocols (I2C/SPI)
    log_msg(TAG, "Output from peripheral enabled : %s", config.oe_ctrl_by_periph ? "Yes" : "No");

    //signal inversed
    log_msg(TAG, "Output inversed enabled : %s", config.oe_inv ? "Yes" : "No");

    //Modes : Push-pull (normal), Open-drain -> pin tends to gnd 0v, for I2C
    log_msg(TAG, "Open-drain enabled : %s", config.od ? "Yes" : "No");

    //define pin's behaviour when sleeping
    log_msg(TAG, "Pin sleep status enabled : %s", config.slp_sel ? "Yes" : "No");
}
#endif

/*
 * This callback function will be called when fade operation has ended
 * Use callback only if you are aware it is being called inside an ISR
 * Otherwise, you can use a semaphore to unblock tasks
 */
static IRAM_ATTR bool cb_ledc_fade_end_event(const ledc_cb_param_t *param, void *user_arg)
{
    BaseType_t taskAwoken = pdFALSE;

#if DEBUG_LEDC
    print_callback_param(*param);
#endif

    //if fade end event
    if (param->event == LEDC_FADE_END_EVT) {
        //getting the semaphore from parameter
        SemaphoreHandle_t counting_sem_local = (SemaphoreHandle_t) user_arg;
        //from ISR because it is an IRAM function (hardware)
        xSemaphoreGiveFromISR(counting_sem_local, &taskAwoken);
    }

    return (taskAwoken == pdTRUE);
}

/**
 * Initalize led
 * -Initialize mutex
 * -Reset pin
 * -Set output mode
 * -Load previous state in nvs and apply it
 */
void led_init() {

    if( xMutex != NULL )
    {
        log_msg(TAG, "Mutex already initialized");
        return;
    }

    xMutex = xSemaphoreCreateMutex();

    if( xMutex == NULL )
    {
        log_msg(TAG, "Error on mutex creation");
        return;
    }

    //reset gpio pin
    esp_err_t err = gpio_reset_pin(LED_PIN);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), LED_PIN);
        return;
    }

    //set output mode for gpio
    err = gpio_set_direction(LED_PIN, GPIO_MODE_OUTPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), LED_PIN);
        return;
    }

    //load led state in nvs and apply it to gpio
    err = load_nvs_int("led_state", &led_state);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) loading nvs int : led_state", esp_err_to_name(err));
        return;
    }
    err = gpio_set_level(LED_PIN, led_state);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting level on pin : %d", esp_err_to_name(err), LED_PIN);
        return;
    }

    log_msg(TAG, "Led initialized on pin %d", LED_PIN);

