FireVirtuozz/ESP32/server/components/ledLib/ledLib.c
}

/**
 * Led on : set level of gpio to HIGH and save it to nvs
 */
void led_on() {

    if (xMutex == NULL) {
        log_msg(TAG, "Error on mutex creation");
        return;
    }

    if (xSemaphoreTake(xMutex, portMAX_DELAY) == pdTRUE) {
        if (led_state == 0) {
            led_state = 1;
            esp_err_t err = gpio_set_level(LED_PIN, led_state);
            if (err != ESP_OK) {
                log_msg(TAG, "Error (%s) setting level on pin : %d", esp_err_to_name(err), LED_PIN);
                xSemaphoreGive(xMutex);
                return;
            }
            err = save_nvs_int("led_state", led_state);
            if (err != ESP_OK) {
                log_msg(TAG, "Error (%s) loading saving led_state in nvs", esp_err_to_name(err));
                xSemaphoreGive(xMutex);
                return;
            }
            log_msg(TAG, "Led on");
        }
        xSemaphoreGive(xMutex);
    }
}

/**
 * Led off : set level of gpio to LOW and save it to nvs
 */
void led_off() {

    if (xMutex == NULL) {
        log_msg(TAG, "Error on mutex creation");
        return;
    }

    if (xSemaphoreTake(xMutex, portMAX_DELAY) == pdTRUE) {
        if (led_state != 0) {
            led_state = 0;
            esp_err_t err = gpio_set_level(LED_PIN, led_state);
            if (err != ESP_OK) {
                log_msg(TAG, "Error (%s) setting level on pin : %d", esp_err_to_name(err), LED_PIN);
                xSemaphoreGive(xMutex);
                return;
            }
            err = save_nvs_int("led_state", led_state);
            if (err != ESP_OK) {
                log_msg(TAG, "Error (%s) loading saving led_state in nvs", esp_err_to_name(err));
                xSemaphoreGive(xMutex);
                return;
            }
            log_msg(TAG, "Led off");
        }
        xSemaphoreGive(xMutex);
    }
}

/**
 * Led toggle : reverse level and save it to nvs
 */
void led_toggle() {

    if (xMutex == NULL) {
        log_msg(TAG, "Error on mutex creation");
        return;
    }

    if (xSemaphoreTake(xMutex, portMAX_DELAY) == pdTRUE) {
        led_state = !led_state;
        esp_err_t err = gpio_set_level(LED_PIN, led_state);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) setting level on pin : %d", esp_err_to_name(err), LED_PIN);
            xSemaphoreGive(xMutex);
            return;
        }
        err = save_nvs_int("led_state", led_state);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) loading saving led_state in nvs", esp_err_to_name(err));
            xSemaphoreGive(xMutex);
            return;
        }
        log_msg(TAG, "Led toggled to : %d", led_state);
        xSemaphoreGive(xMutex);
    }
}

/**
 * Close led
 * -Stop ledc channels, fade, timers
 * -Destroy mutex
 */
void close_led() {

    if (xMutex == NULL) {
        log_msg(TAG, "Error on mutex creation");
        return;
    }

    //destroy ledc
    esp_err_t err;
    for (int i = 0; i < LEDC_NUM_TEST; i++) {
        //idle level to 0 = LOW?
        err = ledc_stop(ledc_channel[i].speed_mode, ledc_channel[i].channel, 0);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) on stop ledc channel %d", esp_err_to_name(err), i);
        }
    }
    ledc_fade_func_uninstall();

    err = ledc_timer_rst(ledc_timer_bts.speed_mode, ledc_timer_bts.timer_num);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) on reset ledc timer BTS", esp_err_to_name(err));
    }
    err = ledc_timer_rst(ledc_timer_mg.speed_mode, ledc_timer_mg.timer_num);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) on reset ledc timer MG", esp_err_to_name(err));
    }

    err = ledc_timer_pause(ledc_timer_bts.speed_mode, ledc_timer_bts.timer_num);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) on pause ledc timer BTS", esp_err_to_name(err));
    }
    err = ledc_timer_pause(ledc_timer_mg.speed_mode, ledc_timer_mg.timer_num);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) on pause ledc timer MG", esp_err_to_name(err));
    }

    if (counting_sem != NULL) {
        vSemaphoreDelete(counting_sem);
        counting_sem = NULL;
    }

    vSemaphoreDelete(xMutex);
    xMutex = NULL;

    log_msg(TAG, "Led & Ledc closed");
}

/**
 * Get led state
 * @return int current led state, -1 if error
 */
int get_led_state() {
    int led = -1;

    if (xMutex == NULL) {
        log_msg(TAG, "Error on mutex creation");
        return led;
    }

    if (xSemaphoreTake(xMutex, portMAX_DELAY) == pdTRUE) {
        led = led_state;
        xSemaphoreGive(xMutex);
    }
    return led;
}

/**
 * Init ledc
 * -Init timers, channels, fade, count semaphore & register fade callback
 */
void init_ledc() {

    esp_err_t err;
    int ch;

    // Set configuration of timer bts & mg for high speed channels
    err = ledc_timer_config(&ledc_timer_bts);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting timer for BTS", esp_err_to_name(err));
        return;
    }

    err = ledc_timer_config(&ledc_timer_mg);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting timer for MG", esp_err_to_name(err));
        return;
    }

    // Set LED Controller with previously prepared configuration
    for (ch = 0; ch < LEDC_NUM_TEST; ch++) {
        err = ledc_channel_config(&ledc_channel[ch]);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) setting channel %d",
                esp_err_to_name(err), ch);
            return;
        }
    }

    // Initialize fade service.
    err = ledc_fade_func_install(0);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) installing fade", esp_err_to_name(err));
        return;
    }
    ledc_cbs_t callbacks = {
        .fade_cb = cb_ledc_fade_end_event
    };
    counting_sem = xSemaphoreCreateCounting(LEDC_NUM_TEST, 0);
    if (counting_sem == NULL) {
        log_msg(TAG, "Error creating ledc semaphore");
        return;
    }


    for (ch = 0; ch < LEDC_NUM_TEST; ch++) {
        err = ledc_cb_register(ledc_channel[ch].speed_mode, ledc_channel[ch].channel, &callbacks, (void *) counting_sem);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) registering callback on channel %d", esp_err_to_name(err), ch);
            return;
        }
    }

