FireVirtuozz/ESP32/server/components/ledLib/ledLib.c
    log_msg(TAG, "LEDC initialized");

#if DEBUG_LEDC || DEBUG_GPIO
    print_esp_info_ledc();
#endif
}

void init_all_gpios() {

    led_init();
    init_ledc();
}

/**
 * Apply fade duty
 * -Set & start fade, and then the ISR callback will be called
 */
void ledc_duty_fade(const uint32_t duty, const uint8_t idx) {

    esp_err_t err;

    err = ledc_set_fade_with_time(ledc_channel[idx].speed_mode,
                                ledc_channel[idx].channel, duty, LEDC_TEST_FADE_TIME);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting fade duty %d on channel %d",
            esp_err_to_name(err), duty, idx);
        return;
    }

    
    ledc_fade_mode_t fade_mode = LEDC_FADE_NO_WAIT; //non blocking
    /*ledc_fade_mode_t fade_mode = LEDC_FADE_WAIT_DONE; //blocking */
    err = ledc_fade_start(ledc_channel[idx].speed_mode,
                    ledc_channel[idx].channel, fade_mode);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) starting fade duty %d on channel %d",
            esp_err_to_name(err), duty, idx);
        return;
    }

    log_msg(TAG, "Starting fade : %d, on channel %d", duty, idx);
    xSemaphoreTake(counting_sem, portMAX_DELAY);
}

/**
 * Apply duty
 * -Set & update duty
 */
void ledc_duty(const uint32_t duty, const uint8_t idx) {

    esp_err_t err;

    err = ledc_set_duty(ledc_channel[idx].speed_mode, ledc_channel[idx].channel, duty);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting duty %d on channel %d",
            esp_err_to_name(err), duty, idx);
        return;
    }

    err = ledc_update_duty(ledc_channel[idx].speed_mode, ledc_channel[idx].channel);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) updating duty %d on channel %d",
            esp_err_to_name(err), duty, idx);
        return;
    }

    log_msg(TAG, "Duty : %d, on channel %d", duty, idx);
}

/**
 * Get current angle of servo
 */
uint8_t get_servo_angle() {
    return current_angle;
}

/**
 * Apply a ledc angle for MG servo
 * -Clamp value, check if the value changed, transform angle to duty & apply it
 * -Write to screen if set
 */
void ledc_angle(int16_t angle) {

    //clamp
    if (angle < 0) angle = 0;
    if (angle > 180) angle = 180;

    if (current_angle != angle) {
        current_angle = angle;

        //applying duty
        ledc_duty(
            MIN_SERVO_DUTY + ((MAX_SERVO_DUTY - MIN_SERVO_DUTY) * angle) / 180, DIRECTION_IDX
        );

        log_msg(TAG, "Angle : %d, on pin %d", angle, MG_GPIO);

#if WRITE_ANGLE_SCREEN

#if USE_LVGL_SCREEN
        set_bar_steer((current_angle - 90) * 200 / 180);
#else
        //print to screen
        char tmp[30];
        snprintf(tmp, sizeof(tmp), "Angle : %d", current_angle);
        ssd1306_draw_string(tmp, 0, 2);
#endif
#endif
    }
    
}

/**
 * Apply a ledc motor for BTS
 * -Clamp value, check if the value changed, transform motor to duty & apply it
 * -Write to screen if set
 */
void ledc_motor(int16_t motor_percent) {

    //clamp
    if (motor_percent < -100) motor_percent = -100;
    if (motor_percent > 100) motor_percent = 100; 

    //deadzone
    if (abs(motor_percent) < DEADZONE_MOTOR) {
        motor_percent = 0;
    }

    if (current_motor != motor_percent) {
        current_motor = motor_percent;

        //applying duty forward et 0 backward
        if (current_motor > 0) {
            ledc_duty(
                MIN_MOTOR_DUTY_FWD + ((MAX_MOTOR_DUTY_FWD - MIN_MOTOR_DUTY_FWD) * current_motor) / 100, MOTOR_IDX_FWD
            );
            ledc_duty(0, MOTOR_IDX_BWD);
        }

        //applying duty backward et 0 forward
        else if (current_motor < 0) {
            ledc_duty(
                MIN_MOTOR_DUTY_BWD + ((MAX_MOTOR_DUTY_BWD - MIN_MOTOR_DUTY_BWD) * - current_motor) / 100, MOTOR_IDX_BWD
            );
            ledc_duty(0, MOTOR_IDX_FWD);
        }

        //applying 0 to backward & forward
        else {
            ledc_duty(0, MOTOR_IDX_FWD);
            ledc_duty(0, MOTOR_IDX_BWD);
        }
        
        log_msg(TAG, "Motor : %d, on pins; fwd : %d, bwd : %d",
            current_motor, BTS_GPIO_FWD, BTS_GPIO_BWD);

#if WRITE_MOTOR_SCREEN

#if USE_LVGL_SCREEN
        set_bar_motor(current_motor);
#else
        //print to screen
        char tmp[30];
        snprintf(tmp, sizeof(tmp), "Motor : %d", current_motor);
        ssd1306_draw_string(tmp, 0, 4);
#endif
#endif
    }
    
}

#if DEBUG_LEDC || DEBUG_GPIO
void print_esp_info_ledc() {

    esp_err_t err;

#if DEBUG_LEDC
    log_msg(TAG, "============= LEDC capabilities =============");

    log_msg(TAG, "LEDC timers        : %d", SOC_LEDC_TIMER_NUM);
    log_msg(TAG, "LEDC channels      : %d", SOC_LEDC_CHANNEL_NUM);
    log_msg(TAG, "Max duty resolution: %d bits", SOC_LEDC_TIMER_BIT_WIDTH);

    //SOC_LEDC_HAS_TIMER_SPECIFIC_MUX;

    #if SOC_LEDC_SUPPORT_HS_MODE
        log_msg(TAG, "High Speed mode    : SUPPORTED");
    #else
        log_msg(TAG, "High Speed mode    : NOT supported (LS only)");
    #endif

    #if SOC_LEDC_SUPPORT_REF_TICK
        log_msg(TAG, "REF_TICK clock     : SUPPORTED (light sleep safe)");
    #else
        log_msg(TAG, "REF_TICK clock     : NOT supported");
    #endif

    #if SOC_LEDC_SUPPORT_APB_CLOCK
        log_msg(TAG, "APB clock (80 MHz) : SUPPORTED");
    #else
        log_msg(TAG, "APB clock (80 MHz) : NOT supported");
    #endif

    uint32_t val;

    int val_int;
    for (int i = 0; i < LEDC_NUM_TEST; i++) {
        print_channel_config(ledc_channel[i]);
        val_int = ledc_get_hpoint(ledc_channel[i].speed_mode, ledc_channel[i].channel);
        log_msg(TAG, "Hpoint channel %d : %d", i, val_int);
        val = ledc_get_duty(ledc_channel[i].speed_mode, ledc_channel[i].channel);
        log_msg(TAG, "Duty channel %d : %d", i, val);
    }

    print_timer_config(ledc_timer_bts);
    print_timer_config(ledc_timer_mg);

    val = ledc_get_freq(ledc_timer_bts.speed_mode, ledc_timer_bts.timer_num);
    log_msg(TAG, "BTS Frequence : %d", val);

    //clock : APB, REF_TICK, RC_FAST
    soc_module_clk_t clock = get_clock_source_by_register(ledc_timer_bts);
    
    //precision : cached, approx, exact, invalid
    //for specific clocks, like RC_FAST 
    esp_clk_tree_src_freq_precision_t precision = ESP_CLK_TREE_SRC_FREQ_PRECISION_EXACT; //exact
    err = esp_clk_tree_src_get_freq_hz(clock, precision, &val);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) getting clock frequency for BTS",
            esp_err_to_name(err));
    }
    log_msg(TAG, "BTS clock frequency : %d", val);

    val = ledc_find_suitable_duty_resolution(val, BTS_FREQ);
    log_msg(TAG, "BTS suitable duty resolution : %d", val);

