FireVirtuozz/ESP32/server/components/ledLib/ledLib.c
    val = ledc_get_freq(ledc_timer_mg.speed_mode, ledc_timer_mg.timer_num);
    log_msg(TAG, "MG Frequence : %d", val);

    clock = get_clock_source_by_register(ledc_timer_mg);

    precision = ESP_CLK_TREE_SRC_FREQ_PRECISION_EXACT; //exact
    err = esp_clk_tree_src_get_freq_hz(clock, precision, &val);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) getting clock frequency for MG",
            esp_err_to_name(err));
    }
    log_msg(TAG, "MG clock frequency : %d", val);

    val = ledc_find_suitable_duty_resolution(val, MG_FREQ);
    log_msg(TAG, "MG suitable duty resolution : %d", val);
#endif

#if DEBUG_GPIO
    log_msg(TAG, "============= GPIO capabilities =============");
    log_msg(TAG, "GPIO pin count        : %d", GPIO_PIN_COUNT);

    gpio_io_config_t out_io_config;
    gpio_drive_cap_t drive_cap;
    for (int i = 0; i < GPIO_PIN_COUNT; i++) {
        err = gpio_get_io_config(i, &out_io_config);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) getting GPIO config for pin %d",
                esp_err_to_name(err), i);
        }
        log_msg(TAG, "GPIO pin %d; valid : %d, valid output: %d, valid pad : %d",
            i, GPIO_IS_VALID_GPIO(i), GPIO_IS_VALID_OUTPUT_GPIO(i), GPIO_IS_VALID_DIGITAL_IO_PAD(i));
        ;
        log_msg(TAG, "Reserved : %s", esp_gpio_is_reserved(BIT64(i)) ? "Yes" : "No");
        print_gpio_config(out_io_config);
        log_msg(TAG, "Level : %d", gpio_get_level(i));
        err = gpio_get_drive_capability(i, &drive_cap);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) getting GPIO drive capability for pin %d",
                esp_err_to_name(err), i);
        }
        log_msg(TAG, "Strength : %s", drive_cap_str(drive_cap));
    }
#endif

    log_msg(TAG, "=============================================");
}
#endif

void dump_gpio_stats() {
#if DEBUG_GPIO
    gpio_dump_io_configuration(stdout, SOC_GPIO_VALID_GPIO_MASK);
#endif
}

/*
==========================
other functions for ledc
==========================
*/

//ledc_set_pin to configure channel config better
//ledc_set_freq

//ledc_set_duty_and_update
//ledc_set_duty_with_hpoint;

//ledc_set_fade
//ledc_set_fade_with_step
//ledc_set_fade_step_and_start
//ledc_set_fade_time_and_start

//ledc_isr_register (deprecated)

//ledc_timer_resume
//ledc_bind_channel_timer (deprecated)

/*
==========================
other functions for gpio
==========================
*/

//TODO : change gpio_reset to gpio_config to control everything

/*for interruptions rising / falling edges, in input mode*/
//gpio_set_intr_type
//gpio_intr_enable
//gpio_intr_disable
//gpio_isr_register
//gpio_install_isr_service
//gpio_uninstall_isr_service
//gpio_isr_handler_add
//gpio_isr_handler_remove

/*for gpio config*/
//gpio_config
//gpio_input_enable
//gpio_set_pull_mode
//gpio_wakeup_enable
//gpio_wakeup_disable
//gpio_pullup_en
//gpio_pullup_dis
//gpio_pulldown_en
//gpio_pulldown_dis
//gpio_output_enable
//gpio_output_disable
//gpio_od_enable
//gpio_od_disable
//gpio_set_drive_capability
//gpio_hold_en
//gpio_hold_dis
//gpio_deep_sleep_hold_en
//gpio_deep_sleep_hold_dis
//gpio_sleep_sel_en
//gpio_sleep_sel_dis
//gpio_sleep_set_direction
//gpio_sleep_set_pull_mode

//rtc gpios : for sleep-active gpios
